{
    "History": [
      {
        "class": "AP World History",
        "grades": [9, 10],
        "description": "Designed to be the equivalent of a two-semester introductory college or university world history course. Students investigate significant events, individuals, developments, and processes from approximately 8000 B.C.E. to the present.",
        "difficulty": 4,
        "subject": "History"
      },
      {
        "class": "AP US Survey",
        "grades": [11],
        "description": "Investigates significant events, individuals, developments, and processes in U.S. history from approximately 1491 to the present. Students develop historical skills and explore eight key themes.",
        "difficulty": 3,
        "subject": "History"
      },
      {
        "class": "AP US through Film, Art, and Music",
        "grades": [11],
        "description": "Explores U.S. history through film, artwork, and music, emphasizing cultural development and historical interpretation through various mediums.",
        "difficulty": 2,
        "subject": "History"
      },
      {
        "class": "AP US Government & Politics",
        "grades": [12],
        "description": "Studies the structure, functions, and powers of the U.S. government and politics. Prepares students for the AP exam.",
        "difficulty": 3,
        "subject": "History"
      },
      {
        "class": "Participation In Government",
        "grades": [12],
        "description": "Explores the American system of government, political parties, and interest groups, along with personal finance topics.",
        "difficulty": 2,
        "subject": "History"
      },
      {
        "class": "Economics",
        "grades": [12],
        "description": "Covers fundamental economic concepts including supply and demand, market prices, income distribution, GDP, and fiscal and monetary policy.",
        "difficulty": 3,
        "subject": "Science"
      },
      {
        "class": "AP Macroeconomics",
        "grades": [12],
        "description": "Studies macroeconomic principles including national income, productivity, employment, trade, and economic policies. Prepares students for the AP exam.",
        "difficulty": 4,
        "subject": "Science"
      },
      {
        "class": "Behavioral & Social Science Class (emphasis in Sociology)",
        "grades": [11, 12],
        "description": "Surveys sociology and other social sciences through discussions, presentations, critiques, and analysis of various topics including race, ethnicity, media, and social policy.",
        "difficulty": 2,
        "subject": "Science"
      }
    ],
    "Science": [
      {
        "class": "AP Biology",
        "grades": [11, 12],
        "description": "AP Biology is a college level two semester introductory course in general biology. Most students who enroll in the equivalent of this course in college are usually interested in further study of biology or medicine. There is less emphasis on breadth of content coverage and more emphasis on in-depth conceptual understanding and science practices. This course requires students to spend more time on inquiry based learning of concepts and development of scientific reasoning skills such as formulating a scientific argument, analyzing case studies, designing a plan for collecting data, analyzing data, applying statistical tests, and connecting concepts across disciplines. SITHS’s goal is to engage students in learning biology so that this course becomes a positive component of their high school experience, that not only prepares them for more advanced study in biology (if they choose to pursue that) but also enriches their life. Sometimes students will practice applying the material alone, and sometimes students will do so with members of their learning team. SITHS wants to foster an interest in biology that continues beyond the date of the final exam, prepares students to make effective choices in the voting booth, enables students to be citizens of the world, and helps them acquire skills that can be used in other endeavors. The sequence of topics is as follows: scientific inquiry, ecology and plant biology, biochemistry, energy and cells, genetics, evolution, and human anatomy and physiology. At the end of the course, it is expected that the student takes and passes the respective Advanced Placement examination.",
        "difficulty": 4,
        "subject": "Science"
      },
      {
        "class": "AP Chemistry",
        "grades": [11, 12],
        "description": "The AP Chemistry course provides students with a college-level foundation to support future advanced coursework in chemistry. Students cultivate their understanding of chemistry through inquiry-based laboratory investigations and classwork, as they explore topics such as: atomic structure, intermolecular forces and bonding, chemical reactions, kinetics, thermodynamics, and equilibrium. The course curriculum is compatible with Chemistry courses in colleges and universities. At the end of the course, it is expected that the student takes and passes the respective Advanced Placement examination.",
        "difficulty": 4,
        "subject": "Science"
      },
      {
        "class": "AP Physics 1",
        "grades": [10],
        "description": "AP Physics 1 is an algebra-based, introductory college-level physics course that explores topics such as Newtonian mechanics (including rotational motion); work, energy, and power; mechanical waves and sound; and introductory, simple circuits. Through inquiry- based learning, students will develop scientific critical thinking and reasoning skills. This course requires that 25 percent of the instructional time will be spent in hands-on laboratory work, with an emphasis on inquiry- based investigations that provide students with opportunities to apply the science practices. No prior coursework in physics is necessary. Students should have completed geometry and be concurrently taking Algebra II or an equivalent course. Although the Physics 1 course includes basic use of trigonometric functions, this understanding can be gained either in the concurrent math course or in the AP Physics 1 course itself. At the end of the course, it is expected that the student takes and passes the respective Advanced Placement examination.",
        "difficulty": 5,
        "subject": "Science"
      },
      {
        "class": "AP Physics 2",
        "grades": [11, 12],
        "description": "AP Physics 2 is an algebra-based, introductory course. Students cultivate their understanding of Physics through inquiry-based investigations as they explore topics such as: fluids; thermodynamics; electrical force, field and potential; electric circuits; magnetism and electromagnetic induction; geometric and physical optics; and quantum, atomic and nuclear physics. AP Physics 2 is a full-year course that is the equivalent of a second-semester introductory college course in algebra-based physics. Prerequisite classes are either Regents Physics or AP Physics 1. At the end of the course, it is expected that the student takes and passes the respective Advanced Placement examination.",
        "difficulty": 5,
        "subject": "Science"
      },
      {
        "class": "AP Physics C: Electricity and Magnetism",
        "grades": [12],
        "description": "The AP Physics C Electricity and Magnetism course is equivalent to a one semester, calculus-based college-level physics course. It is especially appropriate for students planning to specialize or major in physical science or engineering. The course explores concepts such as electrostatics, conductors, capacitors and dielectrics, electric circuits, magnetic fields, and electromagnetism. You’ll do hands-on laboratory work and in-class activities to investigate phenomena and use calculus to solve problems. Introductory differential and integral calculus is used throughout the course. Prerequisite classes include either AP Physics 1, AP Physics 2 or AP Physics C: Mechanics. Co-requisite or prerequisite classes include AP Calculus. At the end of the course, it is expected that the student takes and passes the respective Advanced Placement examination.",
        "difficulty": 5,
        "subject": "Science"
      },
      {
        "class": "AP Environmental Science",
        "grades": [11, 12],
        "description": "This challenging course will take a global perspective to explore the status of sustainable Planet Earth. Students will examine environmental science through labs, field work, case studies, and discussion. As global citizens, students will investigate the practices and services in local, regional, national, and global spaces. First, students will investigate the status of Staten Island’s waterways. Over the next few units, students will investigate the landscape and its biodiversity, discussing how biomes are changing and their impact on various species, including humans. This leads to an understanding of human population growth and its impacts on the environment, demonstrating the elasticity of the earth as well as its limitations. After identifying the consequences of our growth rate, students will determine our energy use and prioritize our energy resources in terms of economic and environmental factors. This segues into climate change – what it’s is, why it’s happening, its effects, and what we can do. The course will culminate in a final unit of sustainable cities, where students will discuss and create their own sustainable community based on the information gathered throughout the year. By the end of the year, each student should take away a concrete understanding of the various footprints on our planet and a plan on how to minimize it. At the end of the course, it is expected that the student takes and passes the respective Advanced Placement examination.",
        "difficulty": 3,
        "subject": "Science"
      },
      {
        "class": "AP Psychology",
        "grades": [11, 12],
        "description": "AP Psychology is the study of behavior and mental processes. The course is the equivalent of a college-level introductory course in Psychology. Usually, the college class is taken over the course of one semester. For students intent on pursuing a major in psychology or neuroscience, this is a required course. For other students, the completion of this course and success on the AP Psychology Examination may serve to fulfill a social science core requirement mandated by select colleges and universities. This course is designed to help students develop invaluable skills such as reading and understanding scientific texts, outlining a plan, and writing out analytical essays based on the ideas presented. This is helpful for those who are thinking of entering into their dream job, even if they don’t yet know which kind of one.",
        "difficulty": 3,
        "subject": "Science"
      },
      {
        "class": "Forensic Science*",
        "grades": [11, 12],
        "description": "Forensic Science is defined as any application of scientific analysis to matters of law. It is a broad, interdisciplinary field that requires in-depth knowledge of chemistry, biology, physics, laboratory techniques, and legal procedures; as well as excellent skills in written communication, verbal communication, and computer applications. The purpose of this course is for students to gain experience in the major investigative techniques currently used by forensic scientists, crime scene investigators, and other law enforcement agencies; and to develop an understanding of the scientific concepts that serve as the basis for these techniques. Students will also familiarize themselves with the law governing evidence collection, admissibility of scientific evidence in court, search and seizure, as well as relevant legal documents. At the end of the course, it is expected that the student takes and passes the respective Advanced Placement examination.",
        "difficulty": 3,
        "subject": "Science"
      },
      {
        "class": "Chemistry",
        "grades": [9, 10],
        "description": "Chemistry is a fascinating and essential field of study. In this course, students explore the principles of chemistry, including the structure of atoms and molecules, chemical reactions, acids and bases, chemical equilibrium and stoichiometry. Students learn how to analyze and interpret chemical reactions, identify and describe the properties of substances, and understand the concepts of chemical bonding, chemical change, and chemical reactions. Students develop an understanding of the scientific concepts that serve as the basis for these techniques. This course prepares students to make effective choices in the voting booth, enables students to be citizens of the world, and helps them acquire skills that can be used in other endeavors.",
        "difficulty": 2,
        "subject": "Science"
      }
      ],
    "Career and Technical": [
        {
            "class": "Intro to STEM Engineering & Robotics",
            "grades": [9],
            "description": "STEM is a freshman level course introducing various engineering fields, design process, teamwork, and technical documentation using Tetrix robotics and Arduino platforms.",
            "difficulty": 3,
            "subject": "Career and Technical"
        },
        {
            "class": "Intro to Audio/Video Engineering & TV Studio",
            "grades": [9],
            "description": "Learn technical aspects of video/audio hardware and software for TV studios and multimedia productions.",
            "difficulty": 3,
            "subject": "Career and Technical"
        },
        {
            "class": "Computer Science & Engineering",
            "grades": [9],
            "description": "Introduction to programming in Python covering core concepts like data structures, conditionals, loops, and web development using HTML, CSS, and Flask.",
            "difficulty": 3,
            "subject": "Career and Technical"
        },
        {
            "class": "Introduction to Technology & Careers",
            "grades": [9],
            "description": "Explores communication protocols, career information sources, emerging technologies, soft skills, digital media presence, and work-based learning opportunities.",
            "difficulty": 2,
            "subject": "Career and Technical"
        },
        {
            "class": "C.A.D./Civil Engineer & Architecture",
            "grades": [10],
            "description": "Teaches 2D/3D design using professional CAD software. Focuses on Autodesk products like AutoCAD and Revit, with industry certifications available.",
            "difficulty": 4,
            "subject": "Career and Technical"
        },
        {
            "class": "Adv. Audio/Video Engineering & TV Studio 1",
            "grades": [10, 11, 12],
            "description": "Full-year elective building on Intro to A/V. Covers advanced techniques in video production, studio operations, and filmmaking skills.",
            "difficulty": 3,
            "subject": "Career and Technical"
        },
        {
            "class": "AP Computer Science Principles (Python and JavaScript versions)",
            "grades": [10, 11, 12],
            "description": "Project-based curriculum in Python or JavaScript focusing on computational thinking, programming, and creating computational artifacts.",
            "difficulty": 4,
            "subject": "Career and Technical"
        },
        {
            "class": "Electronics & Green Technology",
            "grades": [10, 11, 12],
            "description": "Covers digital components, circuit theory, and applications in engineering fields including green technologies like solar and wind power.",
            "difficulty": 3,
            "subject": "Career and Technical"
        },
        {
            "class": "Design & Fabrication “Makerspace”",
            "grades": [10, 11, 12],
            "description": "A full-year elective in the SITHS Makerspace equipped with tools including CNC router and Plasma Table. Students design and develop passion projects, assist peers with project-based learning, and gain skills in painting, sculpture, woodworking, and fabrication.",
            "difficulty": 4,
            "subject": "Career and Technical"
        },
        {
            "class": "Advanced Audio/Video Engineering & TV Studio 2 & 3",
            "grades": [11, 12],
            "description": "Continuation of video production education with projects like 'The SIT Down' news program. Includes studio and mobile production, short films, public service announcements, and more.",
            "difficulty": 3,
            "subject": "Career and Technical"
        },
        {
            "class": "Advanced Computer Applications & Development",
            "grades": [11, 12],
            "description": "Choose from Web Development or Cloud Computing & Cybersecurity. Students work on full-stack applications, cloud computing projects, and ethical hacking simulations.",
            "difficulty": 4,
            "subject": "Career and Technical"
        },
        {
            "class": "Career and Financial Management & Introduction to Entrepreneurship",
            "grades": [11, 12],
            "description": "Dual initiative course through University of Iowa BizInnovator program. Covers innovative mindset, career exploration, financial literacy, and real-world economic scenarios.",
            "difficulty": 2,
            "subject": "Career and Technical"
        },
        {
            "class": "Fundamentals of Engineering",
            "grades": [11, 12],
            "description": "A dynamic survey course exposing students to engineering principles. Includes hands-on applications with Autodesk Inventor Professional and TETRIX Robotics. Covers mechanical, civil, architectural, electrical, and more.",
            "difficulty": 3,
            "subject": "Career and Technical"
        },
        {
            "class": "Advanced CAD",
            "grades": [11, 12],
            "description": "An elective for students to deepen CAD skills. Choose from 3D Modeling (Revit, Inventor, Blender) or Graphic Arts (Adobe Creative Suite). Emphasizes portfolio development for college and career readiness.",
            "difficulty": 4,
            "subject": "Career and Technical"
        },
        {
            "class": "Work-Based Learning Internship",
            "grades": [11, 12],
            "description": "Elective internship course allowing students to work offsite in paid or unpaid internships aligned with NYC Department of Education regulations. Combines in-class meetings with internship hours.",
            "difficulty": 3,
            "subject": "Career and Technical"
        },
        {
            "class": "College Now: Introduction to Film",
            "grades": [11, 12],
            "description": "Offered through the College Now program at CSI, this course introduces film analysis methods. Students learn cinematography, editing, sound, narrative design, genre, and ideology. Tuition-free with college credit at CSI.",
            "difficulty": 3,
            "subject": "Career and Technical"
        }
    ],
    "Math": [
        {
            "class": "Algebra I",
            "grades": [9, 10],
            "description": "Introduces fundamental algebraic concepts including linear equations, inequalities, functions, and graphing. Emphasizes problem-solving and real-world applications.",
            "difficulty": 2,
            "subject": "Math"
          },
          {
            "class": "Geometry",
            "grades": [9, 10],
            "description": "Focuses on geometric concepts such as angles, triangles, circles, polygons, and spatial reasoning. Includes proofs and applications in real-world scenarios.",
            "difficulty": 3,
            "subject": "Math"
          },
          {
            "class": "Algebra II",
            "grades": [10, 11],
            "description": "Builds on Algebra I with more advanced topics including quadratics, logarithms, complex numbers, and systems of equations. Prepares students for advanced math courses.",
            "difficulty": 3,
            "subject": "Math"
          },
          {
            "class": "Pre-Calculus",
            "grades": [11, 12],
            "description": "Covers advanced topics preparing students for calculus. Includes trigonometry, vectors, matrices, conic sections, and advanced functions and their applications.",
            "difficulty": 4,
            "subject": "Math"
          },
          {
            "class": "AP Calculus AB",
            "grades": [11, 12],
            "description": "Introduces students to differential and integral calculus. Emphasizes concepts, methods, and applications of calculus, including limits, derivatives, and integrals.",
            "difficulty": 5,
            "subject": "Math"
          },
          {
            "class": "AP Calculus BC",
            "grades": [11, 12],
            "description": "Extends the topics of AP Calculus AB to include additional techniques and applications of calculus. Covers advanced integration techniques, series, and more complex problems.",
            "difficulty": 5,
            "subject": "Math"
          },
          {
            "class": "Statistics",
            "grades": [12],
            "description": "Introduces statistical concepts including data analysis, probability, distributions, and inferential statistics. Emphasizes real-world applications and critical thinking.",
            "difficulty": 3,
            "subject": "Math"
          }
    ],
    "Ela": [
      {
        "class": "English 1 & 2 (Common Core: Grade 9)",
        "description": "All 9th graders take a one-term Intensive Writing Program, focusing on English Rhetoric and Communication skills that transcend the classroom and become effective, practical and required tools in the real-world. Alternate terms complement the Writing Program with Literature and Language Arts skills, using multiple genres including Shakespearean literature, Greek Mythology, and graphic novels.",
        "difficulty": 2,
        "grades": [9],
        "subject": "Ela"
      },
      {
        "class": "English 3 & 4 (Common Core: Grade 10)",
        "description": "Sophomore year challenges students to deepen their writing voice and use critical reading as intellectual inquiry. Students explore Rebellion Literature using various themes, literary structures, and writing techniques. The course prepares students for the study of rhetorical structures in Junior year.",
        "difficulty": 3,
        "grades": [10],
        "subject": "Ela"
      },
      {
        "class": "English 5 & 6 (Common Core: Grade 11)",
        "description": "Junior year follows the American journey through literature that reflects U.S. history, tracking themes of liberty, justice, and happiness. Students read classic and contemporary texts, improving critical reading, critical thinking, and composition skills.",
        "difficulty": 3,
        "grades": [11],
        "subject": "Ela"
      },
      {
        "class": "AP English Language & Composition (Grade 11)",
        "description": "A full-year course examining writing and rhetoric through fictional and non-fictional works. Students analyze essays, speeches, and prose, developing confidence and skills for the Language and Composition Exam.",
        "difficulty": 4,
        "grades": [11],
        "subject": "Ela"
      },
      {
        "class": "AP English Literature & Composition (Grade 12)",
        "description": "A class of close reading, focusing on author’s craft through poetry, prose, and drama from various time periods. Students analyze literary tools and social dynamics, enhancing their ability to evaluate fiction.",
        "difficulty": 4,
        "grades": [12],
        "subject": "Ela"
      },
      {
        "class": "Modern Mythology: Gods & Monsters* (Grade 12)",
        "description": "Explores world mythology, monsters, and dystopia, examining their impact on Western civilization. Emphasizes collaborative work, independent initiative, and portfolio-based assessment.",
        "difficulty": 3,
        "grades": [12],
        "subject": "Ela"
      },
      {
        "class": "Creative Writing* (Grade 12)",
        "description": "College-level class focusing on creativity in writing. Students explore world-building, plot development, and character creation through various prose styles.",
        "difficulty": 3,
        "grades": [12],
        "subject": "Ela"
      },
      {
        "class": "Publications (Grade 12)",
        "description": "Develops skills in page design, publishing techniques, copywriting, and more. Students work on projects like podcasts, social media management, and yearbook publication.",
        "difficulty": 2,
        "grades": [12],
        "subject": "Ela"
      },
      {
        "class": "Public Speaking (Grade 12)",
        "description": "Prepares students for academic, social, and professional presentations. Covers speech communication, verbal and nonverbal messages, and techniques for persuasive oral presentations.",
        "difficulty": 2,
        "grades": [12],
        "subject": "Ela"
      }
    ],
    "Russian": [
        {
            "class": "Russian Language: Beginner / Heritage",
            "grades": [9],
            "difficulty": 2,
            "description": "Students learn Russian language skills focusing on grammar, reading comprehension, and writing. Designed for both heritage and non-heritage speakers.",
            "subject": "Russian"
          },
          {
            "class": "Russian Language",
            "grades": [10],
            "difficulty": 3,
            "description": "Continuation of Russian language study with an emphasis on intermediate skills and cultural understanding.",
            "subject": "Russian"
          },
          {
            "class": "Russian Language: Accelerated",
            "grades": [10, 11],
            "difficulty": 4,
            "description": "Intensive course for advanced Russian language learners, preparing students for higher proficiency levels.",
            "subject": "Russian"
          },
          {
            "class": "Russian Language: Advanced Heritage",
            "grades": [10],
            "difficulty": 4,
            "description": "Advanced study for heritage speakers focusing on language proficiency and cultural competence.",
            "subject": "Russian"
          },
          {
            "class": "Russian Language",
            "grades": [11],
            "difficulty": 3,
            "description": "Further development of Russian language skills with a focus on fluency and complex linguistic structures.",
            "subject": "Russian"
          },
          {
            "class": "College Level Russian Accelerated",
            "grades": [11, 12],
            "difficulty": 5,
            "description": "University-level course offering Stony Brook University credits. Emphasizes advanced language skills and cultural understanding.",
            "subject": "Russian"
          },
          {
            "class": "College Level Russian Advanced Heritage",
            "grades": [11],
            "difficulty": 5,
            "description": "Advanced course for heritage speakers providing Stony Brook University credits. Focuses on high-level proficiency and specialized topics.",
            "subject": "Russian"
          },
          {
            "class": "Russian for Business",
            "grades": [12],
            "difficulty": 4,
            "description": "Course designed to teach Russian language skills for business purposes, including communication and cultural aspects.",
            "subject": "Russian"
          }
    ],
    "Performing Arts": [
        {
            "class": "Freshmen Band",
            "grades": [9],
            "description": "Freshmen Band is for beginning students and focuses on acquiring fundamentals such as posture, instrument knowledge, and note-reading skills. Students develop basic musicianship through practice and performance in a large ensemble setting.",
            "subject": "Performing Arts"
        },
        {
            "class": "Concert Band",
            "grades": [10],
            "description": "Concert Band continues to build on note-reading skills, musicianship, and rehearsal techniques with increasingly challenging repertoire. Students perform concert works in a large ensemble setting.",
            "subject": "Performing Arts"
        },
        {
            "class": "Symphonic Band",
            "grades": [11, 12],
            "description": "Symphonic Band further develops note-reading skills, musicianship, and rehearsal techniques through challenging concert works. Students perform in a large ensemble setting.",
            "subject": "Performing Arts"
        },
        {
            "class": "Wind Ensemble",
            "grades": [10, 11, 12],
            "description": "Wind Ensemble is the highest level band focusing on advanced repertoire. Students explore deeper listening, precision of execution, phrasing, balance, blend, and interpretive style. Chamber Winds performs advanced high school and early college level works.",
            "subject": "Performing Arts"
        },
        {
            "class": "Jazz Ensemble",
            "grades": [9, 10, 11, 12],
            "description": "Jazz Ensemble is a premier group placing strong emphasis on advanced high school and collegiate repertoire. Students perform throughout the year and participate in jazz festivals, showcasing their improvisation skills.",
            "subject": "Performing Arts"
        },
        {
            "class": "String Ensemble",
            "grades": [9, 10, 11, 12],
            "description": "String Ensemble focuses on acquiring fundamentals such as posture, instrument knowledge, note-reading skills, and rehearsal techniques. Students perform concert works throughout the school year.",
            "subject": "Performing Arts"
        },
        {
            "class": "Marching Band",
            "grades": [10, 11, 12],
            "description": "Marching Band members receive a Physical Education credit. The band performs at festivals, competitions, parades, half-times, and other community functions.",
            "subject": "Performing Arts"
        },
        {
            "class": "Theatre Production",
            "grades": [11, 12],
            "description": "Theatre Production offers students the opportunity to perform in front of their peers and learn about behind-the-scenes roles within a theatre company. Students explore the cultural impact of performing arts through various performance opportunities.",
            "subject": "Performing Arts"
        }
    ],
    "Physical Education": [
      {
        "class": "Health",
        "grades": [9],
        "description": "Health Education is an essential academic subject that teaches young people to take care of their minds, bodies, and the people around them. Health education builds a foundation for academic success by teaching all students how to make healthy and informed decisions. In order to graduate, students are required to complete one term of health education and seven terms of physical education. Students are encouraged to explore various components of health including: Physical Health and Nutrition, Emotional Health, Social Health, Mental Health, and Environmental Health.",
        "subject": "Physical Education"
      },
      {
        "class": "Physical Education",
        "grades": [9, 10, 11, 12],
        "description": "Physical Education class encourages physical activity through various team sports such as soccer, football, basketball, volleyball, softball, tennis, and other team-oriented ball sports. Each sport’s rules and practices are covered. Students work in groups that encourage teamwork, compassion, encouragement, and perseverance. Freshman physical education is an introduction into high school physical education, covering key components of sportsmanship and fitness to ignite a lifelong love of being physically fit.",
        "subject": "Physical Education"
      },
      {
        "class": "Fitness",
        "grades": [10, 11, 12],
        "description": "This course emphasizes the basics of yoga, meditation, and other cardiovascular fitness activities, including the use of free weights and an individual’s bodyweight. Students will build endurance and reflect on their own fitness plans.",
        "subject": "Physical Education"
      },
      {
        "class": "Basketball",
        "grades": [10, 11, 12],
        "description": "This class is for students who wish to concentrate their physical fitness experience in the fast-moving sport of basketball. The class covers the rules, as well as the fundamental and intermediate skills of the game.",
        "subject": "Physical Education"
      },
      {
        "class": "Badminton",
        "grades": [10, 11, 12],
        "description": "This class is for students who want to improve their overall badminton skills and learn the strategies and positions related to badminton.",
        "subject": "Physical Education"
      },
      {
        "class": "Dance",
        "grades": [10, 11, 12],
        "description": "This class is designed to enhance students' love and appreciation of dance through movement. Dance routines span a multitude of genres including but not limited to jazz, hip hop, multicultural, and lyrical dance.",
        "subject": "Physical Education"
      },
      {
        "class": "Table Tennis",
        "grades": [10, 11, 12],
        "description": "This class is for students who want to improve their overall table tennis skills and learn the strategies related to table tennis.",
        "subject": "Physical Education"
      },
      {
        "class": "Volleyball",
        "grades": [10, 11, 12],
        "description": "This class is for students who want to improve their overall volleyball skills and learn the strategies and positions related to volleyball.",
        "subject": "Physical Education"
      },
      {
        "class": "Volleyball Advanced",
        "grades": [10, 11, 12],
        "description": "This class is for students with above-average volleyball skills and the desire to learn advanced strategies in the game of volleyball. Registration for this course requires completing the basic Volleyball course or the recommendation of a physical education teacher.",
        "subject": "Physical Education"
      },
      {
        "class": "Weight Training",
        "grades": [10, 11, 12],
        "description": "This is an introductory course designed to help each student improve muscular strength, understand weight training theory and practice, and develop a personalized weight training program.",
        "subject": "Physical Education"
      },
      {
        "class": "Team Physical Education",
        "grades": [10, 11, 12],
        "description": "Team physical education is designed for upperclassmen who are actively participating on a PSAL sports team from September through June. Student athletes may apply for the class with a recommendation from their PSAL coach.",
        "subject": "Physical Education"
      },
      {
        "class": "Marching Band",
        "grades": [10, 11, 12],
        "description": "This class is for students who are already an active part of the school’s music program. The class performs at various off-site festivals, competitions, parades, halftimes of PSAL games, and other community functions. Additional rehearsals are a requirement for this course.",
        "subject": "Physical Education"
      }
    ]
}